let treedata = {
  name: "Тур. направления",
  children: [
  	{
  		name:"Активный отдых",
  		children:[
  			{
        name:"Походы по России", 
        children:[
          {
          name:"Горные походы", 
          children:[
            {name:"Хибины"},
            {name:"Эльбрус"},
          ]},
          {
          name:"Водные походы",
          children:[
            {name:"р. Шуя"},
            {name:"р. Катунь"},
            {name:"р. Уксанйоки"},
            {name:"р. Мста"},
            {name:"р. Кереть"},
            {name:"р. Тверца"},
            {name:"Белое Море"},
            {name:"Ладожское озеро"},
          ]},
          {
          name:"Пешие походы",
          children:[
            {name:"Байкал"},
            {name:"Камчатка"},
            {name:"Алтай"},
            {name:"Ергаки"},
            {name:"Колвицкие тундры"},
            {name:"Паанаярви"}
          ]},
        ]},
  			{
        name:"Горные лыжи/Сноуборд",
        children:[
            {
            name:"Россия",
            children:[
              {name:"Роза Хутор (Сочи)"},
              {name:"Бобровый лог (Красноярск)"},
              {name:"Сорочаны (Московская область)"},
              {name:"Игора (Ленинградская область)"},
              {name:"Большой Вудъявр (Мурманская область)"},
              {name:"Домбай (Кавказ)"}
            ]},
            {
            name:"Финляндия",
            children:[
              {name:"Рука"},
            ]},
            {
            name:"Швеция",
            children:[
              {name:"Оре"},
            ]},
            {
            name:"Франция",
            children:[
              {name:"Шамони"},
              {name:"Аворья"},
              {name:"Ливиньо"},
              {name:"Сен-Жерве-ле-Бен"}
            ]},
            {
            name:"Италия",
            children:[
              {name:"Ливиньо"}
            ]},
            {
            name:"Швейцария",
            children:[
              {name:"Церматт"},
              {name:"Санкт-Мориц"}
            ]}
          ]},
        {
        name:"Трофи",
        children:[
            {
            name:"Россия",
            children:[
              {name:"п-ов Рыбачий"}
            ]},
          ]},
  	]},
  	{
      name:"Пляжный отдых",
      children:[
          {
          name:"Россия", 
          children:[
            {
            name:"Сочи",
            children:[
              {name:"Сочи"},
              {name:"Адлер"},
              {name:"Дагомыс"},
              {name:"Лазаревское"}
            ]},
            {
            name:"Крым",
            children:[
              {name:"Алушта"},
              {name:"Евпатория"},
              {name:"Ялта"},
              {name:"Гурзуф"},
              {name:"Коктебель"},
              {name:"Балаклава"},
              {name:"Керчь"}
            ]},
            {
            name:"Краснодарский край",
            children:[
              {name:"Анапа"},
              {name:"Ейск"},
              {name:"Небуг"},
              {name:"Лазаревское"},
              {name:"Новороссийск"},
              {name:"Геленджик"},
            ]},
          ]},
          {
          name:"Тропические страны",
          children:[
            {
            name:"Мальдивы",
            children:[
              {name:"Южный Мале"},
              {name:"Маафуши"},
              {name:"Атол Ваадху"},
              {name:"Атолл Ари"},
              {name:"Атолл Лавиани"},
              {name:"Атолл Раа"},
            ]},
            {
            name:"Филлипины",
            children:[
              {name:"Эль-Нидо"},
              {name:"Боракай"},
              {name:"Себу и Бохол"},
            ]},
            {
            name:"Шри-Ланка",
            children:[
              {name:"Тринкомале"},
              {name:"Унаватуна"},
              {name:"Хиккадува"},
            ]},
            {
            name:"Куба",
            children:[
              {name:"Гавана"},
              {name:"Варадеро"},
            ]},
            {
            name:"Доминикана",
            children:[
              {name:"Пунта Кана"},
              {name:"Бока-Чика"},
              {name:"Ла Романа"},
              {name:"Санто-Доминго"},
              {name:"Кап Кана"}
            ]},
            {
            name:"Гавайи",
            children:[
              {name:"Оаху"},
              {name:"Молокаи"},
            ]}
          ]},
          {
          name:"Европейские страны",
          children:[
            {
            name:"Испания",
            children:[
              {name:"Сочи"},
              {name:"Адлер"},
              {name:"Дагомыс"},
              {name:"Лазаревское"}
            ]},
            {
            name:"Португалия",
            children:[
              {name:"Сочи"},
              {name:"Адлер"},
              {name:"Дагомыс"},
              {name:"Лазаревское"}
            ]},
            {
            name:"Греция",
            children:[
              {name:"Сочи"},
              {name:"Адлер"},
              {name:"Дагомыс"},
              {name:"Лазаревское"}
            ]},
            {
            name:"Черногория",
            children:[
              {name:"Сочи"},
              {name:"Адлер"},
              {name:"Дагомыс"},
              {name:"Лазаревское"}
            ]},
            {
            name:"Италия",
            children:[
              {name:"Сочи"},
              {name:"Адлер"},
              {name:"Дагомыс"},
              {name:"Лазаревское"}
            ]},
            {
            name:"Франция",
            children:[
              {name:"Сочи"},
              {name:"Адлер"},
              {name:"Дагомыс"},
              {name:"Лазаревское"}
            ]}
          ]},
          {
          name:"Другое",
          children:[
            {
            name:"США",
            children:[
              {name:"Сочи"},
              {name:"Адлер"},
              {name:"Дагомыс"},
              {name:"Лазаревское"}
            ]},
            {
            name:"Мексика",
            children:[
              {name:"Сочи"},
              {name:"Адлер"},
              {name:"Дагомыс"},
              {name:"Лазаревское"}
            ]},
            {
            name:"Австралия",
            children:[
              {name:"Сочи"},
              {name:"Адлер"},
              {name:"Дагомыс"},
              {name:"Лазаревское"}
            ]},
          ]},
    ]},
    {
      name:"Городской туризм"
    },
    {
      name:"Круизы"
    },
    {
      name:"Религиозный туризм"
    },
    {
      name:"Медицинский туризм",
      children:[
        {name:"Корея"},
        {name:"Израиль"},
      ]},
  ]
}