# Словари для синтаксического анализа #

# Словарь слов и их синонимов, обозначающие направление
user_wish_dict = {
    "где", "где-нибудь", "где-то",
    "куда", "куда-нибудь", "куда-либо",
    "найти", "найтись",
    "нравиться", "любить"
}

user_attract_country_dict = {
    "германия", "куба", "исландия", "мальдивы", "франция",
    "италия", "куба", "норвегия", "сочи", "тайланд", "шри-ланка",
    "хибины"
}

# Словарь слов и их синонимов, обозначающие достопримечательности
user_attract_place_dict = {
    "пляж", "пляжный", "песок", "песчаный",
    "курорт", "курортный",
    "море", "озеро", "река", "речка",
    "горы", "горный"
}

# Словарь слов и их синонимов, обозначающие виды спорта / досуга
user_attract_sport_dict = {
    "лыжа"
}

# Словарь слов и их синонимов, обозначающие действие
user_attract_travel_way_dict = {
    "поехать", "сгонять", "махнуть",
    "отдохнуть",
    "покататься"
}

# Словарь слов и их синонимов, обозначающие погоду
weather_dict = {
    "погода"
}

# Словарь слов и их синонимов, обозначающие температуру воздуха
user_attract_weather_dict = {
    "тёплый", "тепло", "жаркий", "жарко",  # : [20, 40],
    "холодный", "холодно", "морозный", "морозно"  # : [-20, 10]
}

user_attract_time_dict = {
    "сейчас"
}

user_confirmation_dict = {
    "да", "согласен", "конечно"
}

user_rejection_dict = {
    "нет"
}

user_want_it_dict = {
    "оформить"
}

user_want_yes_no_answer_dict = {
    "есть", "мочь"
}